

Mobile IP Working Group                                    H. Haverinen
                                                             J. Malinen
Internet Draft                                                    Nokia
                                                              June 2000



                       Mobile IP Regional Paging
               draft-haverinen-mobileip-reg-paging-00.txt


Status of this Memo

   This document is an Internet-Draft and is in full conformance with
   all provisions of Section 10 of RFC2026.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF), its areas, and its working groups. Note that
   other groups may also distribute working documents as Internet-
   Drafts.

   Internet-Drafts are draft documents valid for a maximum of six
   months and may be updated, replaced, or obsoleted by other documents
   at any time. It is inappropriate to use Internet- Drafts as
   reference material or to cite them other than as "work in progress."

   The list of current Internet-Drafts can be accessed at:
        http://www.ietf.org/ietf/1id-abstracts.txt

   The list of Internet-Draft Shadow Directories can be accessed at:
        http://www.ietf.org/shadow.html.

   This document is an individual submission for the mobile-ip Working
   Group of the Internet Engineering Task Force (IETF).  Comments
   should be submitted to the MOBILE-IP@STANDARDS.NORTELNETWORKS.COM
   mailing list.

   Distribution of this memo is unlimited.

Abstract

   This document specifies Mobile IP Regional Paging (MIRP), a small
   and link-layer independent extension to Mobile IP [2] with regional
   registrations [3], to support power-constrained operation in the
   mobile nodes and to reduce routing state information in the visited
   domain.  The extension allows a mobile node to enter a power saving
   idle mode during which its location is known with the coarse
   accuracy defined by a paging area. Downlink routes to idle mobile
   nodes terminate in a paging foreign agent, which re-establishes them
   on demand by means of paging. This does not require snooping of data
   packets but is a natural extension to network-level routing.
   Optionally, the mobile node and the visited domain can agree on
   communication time slots used for Agent Advertisements and paging,
   to restrict link interface power-on time in the mobile node.

Haverinen and Malinen   Expires December 2000                [Page 1]

Internet Draft        Mobile IP Regional Paging             June 2000


Table of Contents


   Status of this Memo.........................................1
   Abstract....................................................1
   Table of Contents...........................................2
   1. Introduction.............................................2
   2. Terms....................................................3
   3. Protocol Operation.......................................5
   3.1. Paging Area Discovery..................................5
   3.2. Entering Idle Mode.....................................6
   3.3. Paging.................................................7
   3.4. Entering Active Mode...................................8
   4. Protocol Extensions......................................9
   4.1. Advertisement Interval Extension.......................9
   4.2. Paging Area ID Extension..............................10
   4.3. Idle Mode Request Extension...........................10
   4.4. Idle Mode Reply Extension.............................11
   4.5. Paging Request Message................................12
   4.6. Paged Mobile Node Address Extension...................14
   5. IANA Considerations.....................................14
   6. Security Considerations.................................15
   7. IPv6 Considerations.....................................15
   8. Intellectual Property Right Notice......................15
   9. References..............................................15
   Authors' Addresses.........................................16

1. Introduction

   This document specifies an extension to Mobile IP [2] with regional
   registrations [3] in order to support power-constrained operation
   and to reduce routing state information in the visited domain. The
   extension allows a mobile node to enter a power saving idle mode.
   The visited domain does not know the location of idle mobile nodes
   with the accuracy of an IP subnetwork but with a more coarse
   accuracy of a paging area.

   Foreign agents advertise paging support by including a Paging Area
   ID extension in the Agent Advertisements. A mobile node that wishes
   to enter the idle mode sends either a Registration Request or a
   Regional Registration Request with an Idle Mode Request extension to
   the paging foreign agent of the current paging area.  The paging
   foreign agent includes an Idle Mode Reply extension to the
   corresponding Registration Reply or Regional Registration Reply. In
   the idle mode, the mobile node does not need to perform subsequent
   registrations when it moves between the IP subnetworks of the paging
   area.

   The mobile node enters the active mode by performing a normal home
   registration or a normal regional registration. The network may
   trigger this by paging the mobile node. The network pages the mobile
   node by sending an Agent Advertisement with a Paged Mobile Node
   Address extension to a paging multicast address.

Haverinen and Malinen   Expires December 2000                [Page 2]

Internet Draft        Mobile IP Regional Paging             June 2000


   When entering the idle mode, the mobile may optionally negotiate
   time slot based paging to be used. In this case, the mobile node and
   the network agree on the time slots used for Agent Advertisement and
   paging within the paging area.

2. Terms

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "MAY", and "OPTIONAL" in this
   document are to be interpreted as described in RFC 2119 [4].

   This document uses the same terminology as [2]. In addition, this
   document frequently uses the following terms:

   Active Mode

      When a mobile node is in the active mode, it operates as normally
      with regional registrations. In order to send or receive packets,
      the mobile node must be in the active mode.

   Advertisement Interval

      The time between two successive unsolicited Agent Advertisements,
      in milliseconds.

   Advertisement Slot

      A time slot during which an idle mobile node activates its
      receiver to be able to receive the periodical unsolicited Agent
      Advertisements sent by the leaf foreign agents in the paging
      area.

   Crossover Foreign Agent

      When a mobile node is performing a Regional Registration, the
      crossover foreign agent is the foreign agent where the old path
      of tunnels leading to a mobile node and the new path cross, i.e.
      the foreign agent in the hierarchy where a change in the
      tunneling or routing information is needed in order to keep the
      communication path to the mobile node up-to-date.

   Idle Mode

      When a mobile node is in the idle mode, the network knows its
      location with a smaller precision than usual, in a granularity
      defined by the paging area. In the idle mode, the mobile node may
      be able to deactivate some of its components for energy-saving
      purposes.

   Idle Mobile Node

      A mobile node that is in the idle mode.


Haverinen and Malinen   Expires December 2000                [Page 3]

Internet Draft        Mobile IP Regional Paging             June 2000


   Idle Mode Registration

      A home registration or regional registration performed by a
      mobile node in order to enter the idle mode or to extend the
      lifetime of a previous idle mode registration. A mobile node
      performs an idle mode registration by sending either a
      Registration Request or a Regional Registration Request with an
      Idle Mode Request extension.

   Leaf Foreign Agent

      A foreign agent in a regional mobility hierarchy closest to the
      mobile node. This is usually a leaf of a tree structure of
      foreign agents within the visited domain.

   Paging Agent Advertisement

      An Agent Advertisement which is sent to a paging multicast
      address and which contains a Paged Mobile Mode Address extension.

   Paging Area

      An area containing possibly multiple foreign agents where an idle
      mobile node can be without the visited domain knowing anything
      more precise about the location of the idle mobile node. The
      foreign agent at the root of the paging area is called a paging
      foreign agent.

   Paging Foreign Agent

      The foreign agent that maintains the paging state in a paging
      area. The downlink communication paths to idle mobile nodes
      within this paging area terminate in this foreign agent. In the
      foreign agents closer to the mobile node in the hierarchy, that
      is, below this node, there is no need to maintain any
      communication state information for idle mobile nodes.

   Paging Multicast Address

      An IP multicast address used for paging a mobile node by leaf
      foreign agents. When a mobile node is paged, each leaf foreign
      agent sends an Agent Advertisement to this address with the Paged
      Mobile Node Address extension indicating which mobile node is
      being paged. Such advertisements are called paging Agent
      Advertisements. A paging multicast address can be used for paging
      one or more mobile nodes.

   Paging Slot

      A time slot during which an idle mobile node activates its
      receiver to be able to receive the possible paging Agent
      Advertisements sent by the leaf foreign agents in the paging
      area.

Haverinen and Malinen   Expires December 2000                [Page 4]

Internet Draft        Mobile IP Regional Paging             June 2000


   Visited Domain

      The domain defined by a hierarchy of regional-aware foreign
      agents. This domain is usually administered by a single entity
      and can have secure localized signaling between the foreign
      agents in the domain. When the mobile node stays inside one
      visited domain (and the home registration does not expire), the
      mobile node does not need to do home registrations but can use
      the regional registrations to get a fast response from the
      localized location management.

3. Protocol Operation

3.1. Paging Area Discovery

   A leaf foreign agent advertises paging support with the Paging Area
   ID extension in the Agent Advertisement. The mobile node detects its
   current paging area based on the paging area ID. If the Agent
   Advertisement contains an FA NAI extension [3], the mobile node uses
   the pair (paging area ID, the realm part of the FA NAI) as an
   identifier for the paging area. A mobile node considers two foreign
   agents to belong to the same paging area only if the foreign agents
   advertise the same paging area ID, and either both the foreign
   agents advertise the FA NAI with the same realm part or neither of
   the foreign agents advertise the FA NAI.

   When an idle mobile node detects that it has moved to a new paging
   area, it MUST perform either a normal home registration, a normal
   regional registration or an idle mode registration.

   The visited domain can contain anything from zero to as many paging
   areas as there are foreign agents in a visited domain. However, the
   subtree of a paging foreign agent MUST belong to the same paging
   area.

   The advertisement MAY also contain an Advertisement Interval
   extension which specifies the time interval between subsequent
   advertisements. An Advertisement Interval extension with non-zero
   slot length field indicates support for time slot based paging
   within the paging area. In the time slot based paging case, the leaf
   foreign agents of the paging area send Agent Advertisements
   simultaneously with the same advertisement interval.

   A new field in the Advertisement Interval extension indicates the
   length of the advertisement slot in milliseconds. The advertisement
   slot is the time during which idle mobile nodes power on their
   receivers in order to receive unsolicited Agent Advertisements. This
   allows foreign agents with overlapping cells to send their
   advertisements at slightly different times in order to avoid
   interference. Because foreign agents may send their advertisements
   at slightly different times, mobile nodes cannot determine the exact
   instant of the advertisement slot. Therefore, foreign agents do not


Haverinen and Malinen   Expires December 2000                [Page 5]

Internet Draft        Mobile IP Regional Paging             June 2000


   send unsolicited Agent Advertisements during first and the last
   quarter of the advertisement slot.

   Slot sequence number is another new field in the Advertisement
   Interval extension that is used for determining the mobile node's
   paging slot as described in Section 3.2.

   If time-slot based paging is used, the paging area is assumed to
   have a mechanism for synchronizing the clocks of the foreign agents.
   Such a mechanism is beyond the scope of this document.

   If time slot based paging is used, a mobile node that is in the idle
   mode MAY power on its receiver when an unsolicited Agent
   Advertisement or a paging Agent Advertisement is expected and keep
   its receiver powered off at other times. The mobile node doesn't
   have to power on its receiver for every advertisement slot, but it
   MAY power on its receiver only for every Nth advertisement slot,
   where N can be freely picked by the mobile node. If the mobile node
   does not receive an Agent Advertisement during the advertisement
   slot, whether due to leaving the paging area or due to clock skew,
   it SHOULD send an Agent Solicitation and keep its receiver powered
   on until it receives an Agent Advertisement.

3.2. Entering Idle Mode

   When the mobile node is sending or receiving data packets, it is in
   the active mode. When the mobile node is in the active mode, the
   operation is exactly the same as in Mobile IP with regional
   registrations.  When the mobile node is not actively communicating,
   it can enter the idle mode. When the mobile node is in the idle
   mode, the visited domain does not know the exact location of the
   mobile node. The visited domain only knows the paging area of the
   idle mobile node.

   When the mobile node wishes to enter the idle mode, it performs an
   idle mode registration by sending either a Registration Request or a
   Regional Registration Request with an Idle Mode Request extension.
   If time slot based paging is used, the Idle Mode Request extension
   contains the paging slot interval expressed as a multiple of
   advertisement intervals.

   When the paging foreign agent receives the Registration Request or
   the Regional Registration Request with an Idle Mode Request
   extension, it adds the mobile node to the visitor list and marks its
   mode as idle. The entry in the visitor list is otherwise maintained
   as normal entries in regional registrations, but the paging foreign
   agent does not have any tunnels or other routing information for the
   mobile node in its routing table. As any registration, the idle mode
   registration has a lifetime. A mobile node that wishes to stay in
   the idle mode longer than this lifetime must extend the lifetime by
   performing another idle mode registration. The mobile node may also
   extend the lifetime of its home registration and yet stay in the


Haverinen and Malinen   Expires December 2000                [Page 6]

Internet Draft        Mobile IP Regional Paging             June 2000


   idle mode by performing a home registration with the Idle Mode
   Request extension.

   The operation of the paging foreign agent upon receipt of a data
   packet destined to an idle mobile node is specified in Section 3.3.
   The foreign agents closer to the mobile node in the hierarchy do not
   need to maintain any state specific to the mobile node. That is,
   after forwarding the message containing the Idle Mode Reply
   extension to the mobile node, these foreign agents delete the mobile
   node from their visitor lists. If the idle mode registration is a
   regional registration and the crossover foreign agent is above the
   paging foreign agent in the hierarchy, it also receives the Regional
   Registration Request and updates its state as normally in regional
   registrations.

   The paging foreign agent includes an Idle Mode Reply extension to
   the Registration Reply or the Regional Registration Reply. The reply
   contains a paging multicast address. The leaf foreign agents of the
   paging area use this address for paging the mobile node when they
   receive a Paging Request from a paging foreign agent.

   If the optional time slot based paging mechanism is used, the Idle
   Mode Reply extension contains a paging slot index (an integer) and a
   paging slot offset (milliseconds). The paging slot instant is
   determined as follows.  The paging slot is N milliseconds later than
   the advertisement slot for which the slot sequence number of the
   Agent Advertisement modulo the paging slot interval is equal to
   zero. The delay N equals paging slot index times advertisement
   interval plus paging slot offset. In other words, the paging slot
   interval specifies how often a paging slot occurs, and the paging
   slot index and the paging slot offset specify when the paging slots
   occur in relation to unsolicited Agent Advertisements. For example,
   if paging slot interval is four, paging slot index is two and paging
   slot offset is 100 ms, then there is a paging slot 100 ms after
   every fourth advertisement slot. More specifically, the paging slot
   is 100 ms after the advertisement slots for which slot sequence
   number modulo four equals two.

   The length of the paging slot is equal to the length of the
   advertisement slot. Since mobile nodes cannot determine the exact
   instant of the paging slot, foreign agents do not send paging Agent
   Advertisements during first and the last quarter of the paging slot.

   The sequence number field in the Agent Advertisement cannot be used
   in determining the paging slot because the foreign agent increments
   the sequence number also in solicited Agent Advertisements. Thus the
   new slot sequence number field is required.

3.3. Paging

   When the paging foreign agent receives a packet from a correspondent
   node destined to a mobile node that has the idle flag set, the
   paging foreign agent does not forward the packet to any lower

Haverinen and Malinen   Expires December 2000                [Page 7]

Internet Draft        Mobile IP Regional Paging             June 2000


   foreign agent. Instead, the paging foreign agent sends a Paging
   Request to its child foreign agents which forward the message to
   their child foreign agents recursively. The leaf foreign agents send
   a paging Agent Advertisement to the mobile node using the paging
   multicast address. This advertisement contains a Paged Mobile Node
   Address extension which identifies the target among the mobile nodes
   listening to this paging multicast address. When time slot based
   paging is supported, the Paging Request contains the paging slot
   interval, the paging slot index, and the paging slot offset.

   The leaf foreign agents send the paging Agent Advertisement with a
   Paged Mobile Node Address extension to the mobile node's paging
   multicast address. Besides the Paged Mobile Node Address extension,
   the leaf foreign agent includes the same extensions that it normally
   includes in solicited Agent Advertisements.

   If time slot based paging is used, the leaf foreign agents send the
   paging Agent Advertisement during the second or the third quarter of
   the mobile node's paging slot.

   The mobile node is expected to perform an ordinary home registration
   or an ordinary regional registration in response to a paging Agent
   Advertisement. The paging foreign agent MAY retransmit the Paging
   Request after a timeout. If the mobile node has not performed a
   regional registration after a small number of retransmissions, the
   paging foreign agent SHOULD send a Destination Unreachable ICMP
   message to the correspondent node.

   While waiting for the response of the mobile node, the paging
   foreign agent MAY buffer the data destined to the mobile node. When
   the mobile node has entered the active mode, the paging foreign
   agent can stop buffering and forward the buffered packets to the
   mobile node. The paging foreign agent discards buffered packets
   after a timeout.

3.4. Entering Active Mode

   When the mobile node receives an Agent Advertisement to its paging
   multicast address and the advertisement contains the address of the
   mobile node in the Idle Mobile Node Address extension, the mobile
   node enters the active mode. The mobile node can also enter the
   active mode if it needs to send a packet.

   When entering the active mode, the mobile node sends a Registration
   Request or a Regional Registration Request. This changes the state
   of the visited domain as defined in the regional registrations [3].
   This registration clears the idle mode in the paging foreign agent
   and allows all subsequent data to reach the mobile node.






Haverinen and Malinen   Expires December 2000                [Page 8]

Internet Draft        Mobile IP Regional Paging             June 2000


4. Protocol Extensions

4.1. Advertisement Interval Extension

   Mobile IPv6 [5] defines an Advertisement Interval option, used in
   Router Advertisement messages to advertise the interval at which the
   sending router sends unsolicited multicast Router Advertisements.
   The regional paging support uses the format of this option in a
   skippable extension to the unsolicited IPv4 Agent Advertisement,
   with an additional slot length field. Foreign agents do not include
   the Advertisement Interval extension in solicited Agent
   Advertisements. The format of the Advertisement Interval extension
   is as follows:

     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |     Type      |    Length     |          Slot Length          |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                     Advertisement Interval                    |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |   (Slot Sequence Number)      |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      TBD (skippable)

   Length

      8-bit unsigned integer.  The length of the option, excluding the
      type and length fields, in octets.  The value of this field MUST
      be 6.

   Slot Length

      16-bit unsigned integer. Indicates the length, in milliseconds,
      of the advertisement slot during which the mobile nodes activate
      their receivers in order to receive unsolicited Agent
      Advertisements, if time slot based paging is supported. Because
      non-zero slot length is useful only when paging is supported, the
      Agent Advertisement MUST also include a Paging Area ID extension
      if the slot length is non-zero. If the slot length field is zero,
      it indicates that the Paging Area does not support time slot
      based paging.

      The slot length also specifies the length of the paging slot
      within the paging area.





Haverinen and Malinen   Expires December 2000                [Page 9]

Internet Draft        Mobile IP Regional Paging             June 2000


   Advertisement Interval

      32-bit unsigned integer.  The time, in milliseconds, between
      successive unsolicited router Agent Advertisement messages sent
      by this foreign agent on this network interface. Note that unlike
      in the original Mobile IPv6 Advertisement Interval Option, the
      Advertisement Interval field in this extension specifies the
      exact interval, not the maximum interval.

   Slot Sequence Number

      An optional field that contains a 16-bit unsigned integer. This
      field is included if time slot based paging is supported. The
      slot sequence number in each unsolicited Agent Advertisement is
      one greater than in the previous unsolicited Agent Advertisement.
      All the foreign agents in a paging area must advertise the same
      slot sequence number. The slot sequence number is used for
      determining mobile nodes' paging slot, as specified in Section
      3.2.Paging Area ID Extension

   The Paging Area ID extension is defined as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Length    |      Paging Area ID           |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      TBD (skippable)

   Length

      The length (in octets) of the Paging Area ID field.

   Paging Area ID

      A 16-bit identifier.The foreign agent that supports regional
   paging indicates the support by including the Paging Area ID
   extension in the Agent Advertisement message. If present, the Paging
   Area ID extension MUST appear in the Agent Advertisement message
   after any of the advertisement extensions defined in [6].

4.3. Idle Mode Request Extension

   The Idle Mode Request extension is defined as follows:






Haverinen and Malinen   Expires December 2000               [Page 10]

Internet Draft        Mobile IP Regional Paging             June 2000


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Length    |     (Paging Slot Interval)    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      TBD (non-skippable)

   Length

      The length of the fields excluding the Type and the Length
      fields, in octets. If the mobile node requests time slot based
      paging, the length equals to 2, else the length equals to zero.

   Paging Slot Interval

      An optional field that contains a 16-bit unsigned integer. If the
      mobile node requests time slot based paging, the paging slot
      interval is used for determining the mobile node's paging slot,
      as specified in Section 3.2.

4.4. Idle Mode Reply Extension

   The Idle Mode Reply extension is defined as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Length    |           Reserved            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   Paging Multicast Address                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     (Paging Slot Index)       |   (Paging Slot Offset)        |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      TBD (non-skippable)

   Length

      The length of the fields excluding the Type and the Length
      fields, in octets. If time slot based paging is used, the length
      equals to 10, else the length equals to 6.

   Reserved

      This field is unused.  It MUST be initialized to zero by the
      sender and MUST be ignored by the receiver.

Haverinen and Malinen   Expires December 2000               [Page 11]

Internet Draft        Mobile IP Regional Paging             June 2000


   Paging Multicast Address

      An IP address used for paging the mobile node. If a correspondent
      node sends a datagram to the mobile node while the mobile node is
      in the idle mode, the network pages the mobile node by sending a
      paging Agent Advertisement to this multicast address. The paging
      foreign agent can decide how to assign these addresses.

   Paging Slot Index

      An optional field that contains a 16-bit unsigned integer. If
      time slot based paging is supported, the paging slot index is
      used for determining the mobile node's paging slot, as specified
      in Section 3.2.

   Paging Slot Offset

      An optional field that contains a 16-bit unsigned integer. If
      time slot based paging is supported, the paging slot offset is
      used for determining the mobile node's paging slot, as specified
      in Section 3.2.

4.5. Paging Request Message

   When paging a mobile node, the paging foreign agent sends a Paging
   Request Message to its descendants in the paging area. The
   recipients of this message that have active interfaces capable of
   serving mobile nodes then send a paging Agent Advertisement to those
   interfaces in order to page the mobile node.

   The Paging Request message is an UDP packet sent to the UDP Port
   434. The Paging Request message contains the addresses of the paged
   mobile nodes and optionally parameters for calculating the point of
   time when to page the mobile node.

   IP fields:

      Source Address: Typically the interface address from which the
      message is sent.

      Destination Address: The address of lower foreign agent.

   UDP fields:

      Source Port: variable

      Destination Port: 434

   The UDP header is followed by Paging Request fields shown below:





Haverinen and Malinen   Expires December 2000               [Page 12]

Internet Draft        Mobile IP Regional Paging             June 2000


    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |   Reserved    |    Paging Slot Interval       |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |      Paging Slot Index        |    Paging Slot Offset         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   Paging Multicast Address                    |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                 Paged Mobile Node Addresses..                 |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   The Paging Request fields can be followed by a Foreign-Foreign
   Authentication extension.

   Type

      TBD

   Reserved

      This field is unused. It MUST be initialized to zero by the
      sender and MUST be ignored by the receiver.

   Paging Slot Interval

      16-bit unsigned integer. The interval between two successive
      paging slots, in multiples of advertisement intervals. If time
      slot based paging is not used, this field must be set to zero.

   Paging Slot Index

      16-bit unsigned integer. A parameter used for determining the
      mobile node's paging slot, as specified in Section 3.2. If time
      slot based paging is not used, this field must be set to zero.

   Paging Slot Offset

      16-bit unsigned integer. A parameter used for determining the
      mobile node's paging slot, as specified in Section 3.2. If time
      slot based paging is not used, this field must be set to zero.

   Paging Multicast Address

      An IP multicast address used for paging the mobile node. In the
      idle mode the mobile node listens to this address for the agent
      advertisements which indicate paging of the mobile node by the
      network.





Haverinen and Malinen   Expires December 2000               [Page 13]

Internet Draft        Mobile IP Regional Paging             June 2000


   Paged Mobile Node Addresses

      The IP home address of the mobile node that is the target of
      paging. For efficiency reasons, there MAY be more than one mobile
      node addresses listed in this field.

4.6. Paged Mobile Node Address Extension

   The Paged Mobile Node Address extension is used for the identifying
   the mobile node that is paged with the paging Agent Advertisement.
   This allows several mobile nodes to share a paging multicast
   address. The motivation for using an Agent advertisement for paging
   is that in order to return to the active mode by performing a home
   registration or a regional registration, the mobile node needs an
   Agent Advertisement anyway.

   The Paged Mobile Node Address extension is defined as follows:

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Length    |           Reserved            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                   Paged Mobile Node Addresses..               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      TBD (skippable)

   Length

      The length of the fields excluding the Type and the Length
      fields, in octets.

   Reserved

      This field is unused. It MUST be initialized to zero by the
      sender and MUST be ignored by the receiver.

   Paged Mobile Node Addresses

      The IP home address of the mobile node that is the target of
      paging. For efficiency reasons, there MAY be more than one mobile
      node addresses listed in this field.

5. IANA Considerations

   MIRP requires a new Mobile IP Message type to be used for sending
   the Paging Request message to the UDP port 434 (Section 4.5).



Haverinen and Malinen   Expires December 2000               [Page 14]

Internet Draft        Mobile IP Regional Paging             June 2000


   MIRP requires three new extension types to be used in combination
   with the Agent Advertisement: a skippable type for Advertisement
   Interval extension (Section 4.1), a skippable type for the Paging
   Area ID extension (Section 4.2), and a skippable type for the Paged
   Mobile Node Address extension (Section 4.6).

   MIRP requires two new extension types to be used in combination with
   the Registration Request or Reply: a non-skippable type for the Idle
   Mode Request extension and a non-skippable type for Idle Mode Reply
   extension (Sections 4.3 and 4.4, respectively).

6. Security Considerations

   MIRP uses the same security mechanisms as regional registrations
   [3]. More specifically, the Idle Mode registration is protected by
   the Mobile-Foreign Authentication extension using the same key
   distribution and replay protection mechanisms as specified for the
   regional registrations. The Paging Request message is protected by
   the FA-FA Authentication extension [3].

7. IPv6 Considerations

   Several proposals with regional registrations support for IPv6 are
   currently under development. The mechanisms are likely to be similar
   to regional registrations for IPv4. The mechanisms specified here
   for Mobile IPv4 should be easily applicable to IPv6.

8. Intellectual Property Right Notice

   Nokia may or may not have patents or patent applications that are
   applicable for this contribution. In case such patents exist or are
   subsequently granted, Nokia is willing to grant licenses on these
   patents on terms according to RFC 2026, section 10.

9. References



   [1]   Bradner, S., "The Internet Standards Process -- Revision 3",
         BCP 9, RFC 2026, October 1996.

   [2]   C. Perkins, Editor.  "IP Mobility Support".  RFC 2002bis,
         March 2000.

   [3]   C. Perkins, E. Gustafsson, and A. Jonsson. "Mobile IP Regional
         Registrations". Internet draft (work in progress), draft-ietf-
         mobileip-reg-tunnel-02.txt, March 2000.

   [4]   S. Bradner.  "Key words for use in RFCs to indicate
         Requirement Levels".  RFC 2119, March 1997.




Haverinen and Malinen   Expires December 2000               [Page 15]

Internet Draft        Mobile IP Regional Paging             June 2000



   [5]   C. Perkins and D. B. Johnson.  "Mobility Support in IPv6",
         draft-ietf-mobileip-ipv6-13.txt, May 2000.  (work in
         progress).

   [6]   Charles E. Perkins and Pat R. Calhoun.  AAA registration keys
         for Mobile IP. draft-ietf-mobileip-aaa-key-00.txt, June 1999.
         (work in progress).

Authors' Addresses

   Henry Haverinen
   Nokia Mobile Phones
   P.O. Box 88
   FIN-33721 Tampere
   Finland
   email: henry.haverinen@nokia.com
   phone: +358 50 594 4899
   fax:   +358 3 318 3690


   Jari T. Malinen
   Nokia Research Center
   Itamerenkatu 11-13
   FIN-00180 Helsinki
   Finland
   email: jari.t.malinen@nokia.com
   phone: +358 40 7499 138
   fax:   +358 9 4376 6852

























Haverinen and Malinen   Expires December 2000               [Page 16]
